---
kind: method
id: M:Autodesk.Revit.DB.Rectangle.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
source: html/28a8234c-ed1b-0d1f-ec7c-a704e11bfe1b.htm
---
# Autodesk.Revit.DB.Rectangle.#ctor Method

Creates an Rectangle instance with the specified four integers
 that represent the left, top, right and bottom of a rectangle.

## Syntax (C#)
```csharp
public Rectangle(
	int left,
	int top,
	int right,
	int bottom
)
```

## Parameters
- **left** (`System.Int32`) - The x-coordinate of the top-left corner.
- **top** (`System.Int32`) - The y-coordinate of the top-left corner.
- **right** (`System.Int32`) - The x-coordinate of the bottom-right corner.
- **bottom** (`System.Int32`) - The y-coordinate of the bottom-right corner.